
from string import Template

system_prompt = Template("\n".join([
    "أنت مساعد مفيد يجيب عن الأسئلة بناءً على السياق المقدم.",
    "سيتم تزويدك بسياق وسؤال.",
    "مهمتك هي استخراج المعلومات ذات الصلة من السياق للإجابة على السؤال.",
    "إذا لم يحتوي السياق على معلومات كافية للإجابة على السؤال، فأجب بـ 'لا أعرف'.",
    "إذا كان السياق يحتوي على معلومات غير مرتبطة بالسؤال، فتجاهلها.",
    "يجب ألا تخترع أي معلومات."
]))

doc_prompt = Template("\n".join([
    "رقم المستند: $doc_num",
    "محتوى المستند: $doc_content"
]))

footer_prompt = Template("\n".join([
    "بناءً فقط على المستندات أعلاه، يرجى توليد إجابة للمستخدم.",
    "الإجابة:"
]))
